<?php

return [

    /*
    |--------------------------------------------------------------------------
    | All Models names
    |--------------------------------------------------------------------------
    */

    'product' => 'محصول',
    'address' => 'آدرس',
    'shop' => 'فروشگاه',
    'province' => 'استان',
    'state' => 'شهر',
    'order' => 'پیش فاکتور',
    'purchase' => 'سفارش',
    'password' => 'رمز عبور',
    'mobile' => 'شماره موبایل',
    'user' => 'کاربر',
    'response' => 'پاسخ',
    'wallet' => 'کیف پول',
    'profile' => 'پروفایل',
    'student' => 'شاگرد',
];
